// Первая программа на чистом C
// ----------------------------
// Подключаем библиотеку: **stdio.h**
//-->
/* Hello World на C
   Многострочный комментарий...
*/
#include <stdio.h> /* Подключаем библиотеку */
// Директива препроцессора, вставляющая содержимое файла stdio.h
// #include <stdlib.h> /* ..ещё одну библиотеку */
//#include <iostream> // Для C++

int main() {
  printf("C: Hello world!\n");
  //std::cout << "Test" << std::endl;  // Для C++
  return 0;
}
//<--
// Кодировка файла: cp866 win1251

